from collections import defaultdict


TWO_CHAR_KEYS = defaultdict(lambda x: x, {
    "oʊ": "o",
    "eɪ": "ä",
    "aɪ": "ï",
    "aʊ": "ö",
    "ɔɪ": "ÿ",
    "ɑɹ": "ā",
    "ɪɹ": "ī",
    "ʊɚ": "ō",
    "ʊɹ": "ō",
    "ɔɹ": "ō",
    "æɹ": "à",
    "ɛɚ": "à",
    "eɹ": "à",
    "ɛɹ": "à",
    "tʃ": "c",
    "dʒ": "j",
    "hw": "ξ",
})

ONE_CHAR_KEYS = defaultdict(lambda x: x, {
    "æ": "a",
    "ɛ": "e",
    "ɪ": "i",
    "ə": "u",
    "ʌ": "u",
    "i": "ë",
    "u": "ü",
    "ɝ": "ē",
    "ɚ": "ē",
    "ɔ": "ò",
    "ɑ": "ò",
    "ʊ": "ù",
    "ɫ": "l",
    "ɹ": "r",
    "j": "y",
    "θ": "þ",
    "ð": "þ",
})
